app/Controllers/Register.php

INSERT INTO `users` (`username`, `password`, `name`, `created_at`, `updated_at`) VALUES ('cumi', '$2y$10$S6vqPwtgFtuMz/HFKID9CeHCruzPVbNkNruRxvvihRS4ngLfFaBOW', 'cumi', '2023-01-08 14:20:54', '2023-01-08 14:20:54')
---
            return redirect()->back()->withInput();
        }
        $users = new UsersModel();
        $users->insert([
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'name' => $this->request->getVar('name')
        ]);